BaseConfiguration/Money_2_0/DataProcessors/МониторСинхронизацииСМобильнымиУстройствами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>МониторСинхронизацииСМобильнымиУстройствами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/СостоянияПроцессовОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПроцессовОбменаДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Comment>Используемый вид транспорта для обмена с узлом</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаСообщенийОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПроцессовОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодРезультатаДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПакета</Name>
					<Comment># пакета, используемого в действии. Может не совпадать с номером принятого/отправленного в узле</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>кол-во частей пакета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОбработанного</Name>
					<Comment>номер части, которую обработал процесс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗавершениеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцессЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектовВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектовОбработано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОбменаФайлами</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияАвтономныхКопий</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.МобильноеПриложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПроцессыОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/ПроцессыОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПроцессыОбменаДанными</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/DataProcessors/МониторСинхронизацииСМобильнымиУстройствами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьСостояниеПрцессаНаФорме(Форма, ИДФоновогоЗадания = Неопределено) Экспорт
	
	ВсеКоды          = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	Форма.СостояниеОбмена  = АвтоматОбменаФайлами.СостояниеОбмена(Форма.ВидТранспорта);
	ОписаниеКода     = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(Форма.СостояниеОбмена.КодРезультатаДействия);
	МоментЗавершения = Формат(Форма.СостояниеОбмена.ЗавершениеДействия, "ДФ='dd.MM.yyyy HH:mm';");
	МоментНачала     = Формат(Форма.СостояниеОбмена.НачалоДействия, "ДФ='dd.MM.yyyy HH:mm';");
	
	Форма.Элементы.ИконкаСостоянияОбмена.Картинка = Новый Картинка();
	
	Если Не Форма.СостояниеОбмена.ИспользоватьСинхронизацию Тогда
		Форма.Элементы.ИконкаСостоянияОбмена.Картинка = БиблиотекаКартинок.СинхронизацияОшибка48;
		Форма.СостояниеПроцессаОбмена = НСтр("ru='Синхронизация отключена'");
		Форма.СообщениеПроцессаОбмена = НСтр("ru='Включите синхронизацию в настройках'");
		
	ИначеЕсли Не Форма.СостояниеОбмена.СтатусТранспорта.СоединениеНастроено Тогда 
		Форма.Элементы.ИконкаСостоянияОбмена.Картинка = БиблиотекаКартинок.СинхронизацияОшибка48;
		Форма.СостояниеПроцессаОбмена = НСтр("ru='Настройки некорректны или отсутствуют'");
		Форма.СообщениеПроцессаОбмена = ?(ЗначениеЗаполнено(Форма.СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения),
				Форма.СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения,
				НСтр("ru='Проверьте настройки соединения'"));
			
	ИначеЕсли Форма.СостояниеОбмена.ПроцессАктивен Тогда 
		// Обмен не завершен. Возможно, протекает в фоне или остановлен
		
		Форма.СостояниеПроцессаОбмена = "";
		Форма.СообщениеПроцессаОбмена = "";
		АвтоСинхронизация             = Не Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить();
		
		Если ЗначениеЗаполнено(ИДФоновогоЗадания) Тогда
			ЗаданияВыполняются = Не ДлительныеОперации.ЗаданиеВыполнено(ИДФоновогоЗадания);
		Иначе
			ЗаданияВыполняются = РегламентныеЗаданияСервер.РегламентноеЗаданиеИспользуется(
						Метаданные.РегламентныеЗадания.ОбменФайламиСМобильными)
						И АвтоСинхронизация;
			Если Не ЗаданияВыполняются Тогда
				ЗаданияВыполняются = АвтоматОбменаФайлами.ФоновоеЗаданиеОбмена(Истина) <> Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаданияВыполняются Тогда
			
			Форма.Элементы.ИконкаСостоянияОбмена.Картинка = БиблиотекаКартинок.СинхронизацияИдетОбмен48;
			Форма.СостояниеПроцессаОбмена = СтрШаблон(НСтр("ru='%1 (начало: %2)'"), Форма.СостояниеОбмена.ДействиеПроцесса, МоментНачала);
			Форма.СообщениеПроцессаОбмена = НСтр("ru='%1
			|
			|Обмен файлами выполняется в фоновом режиме, дождитесь его завершения.
			|При необходимости этот обмен можно отменить, переключив способ обмена на вариант ""Вручную"". В этом случае весь обмен придется начинать заново'",
			Форма.СостояниеПроцессаОбмена);
			
		ИначеЕсли АвтоСинхронизация Тогда
			Форма.Элементы.ИконкаСостоянияОбмена.Картинка = БиблиотекаКартинок.СинхронизацияНетОбмена48;
			Форма.СостояниеПроцессаОбмена = СтрШаблон(НСтр("ru='%1 (начало: %2)'"), Форма.СостояниеОбмена.ДействиеПроцесса, МоментНачала);
			Форма.СообщениеПроцессаОбмена = НСтр("ru='%1
			|
			|Обмен файлами был приостановлен. Дождитесь запуска нового обмена.
			|При необходимости этот обмен можно отменить, переключив способ обмена на вариант ""Вручную"". В этом случае весь обмен придется начинать заново'",
			Форма.СостояниеПроцессаОбмена);
				
		Иначе
			Форма.Элементы.ИконкаСостоянияОбмена.Картинка = БиблиотекаКартинок.СинхронизацияНетОбмена48;
			Форма.СостояниеПроцессаОбмена = СтрШаблон(НСтр("ru='%1 (начало: %2)'"), Форма.СостояниеОбмена.ДействиеПроцесса, МоментНачала);
			Форма.СообщениеПроцессаОбмена = НСтр("ru='%1
			|
			|Обмен файлами не был завершен.
			|'",
			Форма.СостояниеПроцессаОбмена);
				
		КонецЕсли;
		
	Иначе
		// обмен завершен
		
		Если Форма.СостояниеОбмена.КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
			Форма.Элементы.ИконкаСостоянияОбмена.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
			Форма.СостояниеПроцессаОбмена = СтрШаблон(НСтр("ru='обмен выполнен: %1'"), 
					МоментЗавершения);
			Форма.СообщениеПроцессаОбмена = "";
			
		Иначе
			Форма.СообщениеПроцессаОбмена = ТекстПодробностейСостоянияОбмена(ОписаниеКода, Форма.СостояниеОбмена.ТекстОшибки);
			Если ОписаниеКода.ЯвляетсяОшибкой Тогда
				Форма.Элементы.ИконкаСостоянияОбмена.Картинка = БиблиотекаКартинок.ОформлениеКрест;
				Форма.СостояниеПроцессаОбмена = СтрШаблон(НСтр("ru=' %1: в процессе обмена возникла ошибка - %2'"), 
						МоментЗавершения, 
						ОписаниеКода.ТекстОписания);
			Иначе
				Форма.Элементы.ИконкаСостоянияОбмена.Картинка = БиблиотекаКартинок.ДиалогВосклицание;
				Форма.СостояниеПроцессаОбмена = СтрШаблон(НСтр("ru=' %1: %2'"), 
						МоментЗавершения,
						ОписаниеКода.ТекстОписания);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.Элементы.ГруппаПоказатьСообщениеОбмена.Видимость = ЗначениеЗаполнено(Форма.СообщениеПроцессаОбмена);
	
КонецПроцедуры

Процедура ОбновитьСписокУзлов(Форма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МобильноеПриложение.Ссылка КАК Устройство,
	|	МобильноеПриложение.ПометкаУдаления КАК ПометкаУдаления,
	|	МобильноеПриложение.Активность КАК Активность,
	|	МобильноеПриложение.ПользовательМобильногоУстройства КАК Пользователь,
	|	УспешныеВыгрузки.ДатаОкончания КАК ДатаУспешнойВыгрузки,
	|	УспешныеЗагрузки.ДатаОкончания КАК ДатаУспешнойЗагрузки,
	|
	|	СостояниеПроцессаПередача.ЗавершениеДействия КАК ВыгрузкаДата,
	|	СостояниеПроцессаПередача.ДействиеПроцесса КАК ВыгрузкаДействие,
	|	СостояниеПроцессаПередача.КодРезультатаДействия КАК ВыгрузкаКодРезультата,
	|	СостояниеПроцессаПередача.ТекстОшибки КАК ВыгрузкаТекстОшибки,
	|
	|	СостояниеПроцессаПрием.ЗавершениеДействия КАК ЗагрузкаДата,
	|	СостояниеПроцессаПрием.ДействиеПроцесса КАК ЗагрузкаДействие,
	|	СостояниеПроцессаПрием.КодРезультатаДействия КАК ЗагрузкаКодРезультата,
	|	СостояниеПроцессаПрием.ТекстОшибки КАК ЗагрузкаТекстОшибки
	|ИЗ
	|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПроцессовОбменаДанными КАК СостояниеПроцессаПрием
	|		ПО МобильноеПриложение.Ссылка = СостояниеПроцессаПрием.Узел
	|		И СостояниеПроцессаПрием.Процесс = Значение(Перечисление.ПроцессыОбменаДанными.Прием)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПроцессовОбменаДанными КАК СостояниеПроцессаПередача
	|		ПО МобильноеПриложение.Ссылка = СостояниеПроцессаПередача.Узел
	|		И СостояниеПроцессаПередача.Процесс = Значение(Перечисление.ПроцессыОбменаДанными.Передача)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияУспешныхОбменовДанными КАК УспешныеВыгрузки
	|		ПО МобильноеПриложение.Ссылка = УспешныеВыгрузки.УзелИнформационнойБазы
	|		И (УспешныеВыгрузки.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияУспешныхОбменовДанными КАК УспешныеЗагрузки
	|		ПО (МобильноеПриложение.Ссылка = УспешныеВыгрузки.УзелИнформационнойБазы)
	|		И (УспешныеВыгрузки.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|ГДЕ
	|	НЕ МобильноеПриложение.ЭтотУзел
	|
	|УПОРЯДОЧИТЬ ПО
	|	МобильноеПриложение.Активность УБЫВ,
	|	МобильноеПриложение.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтрокиТаблицы = СоответствиеСтрокТаблицы(Форма);
	УстройстваИзЗапроса = Новый Соответствие;
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.Активность  Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = СтрокиТаблицы[Выборка.Устройство];
		Если СтрокаТаблицы = Неопределено Тогда
			СтрокаТаблицы = Форма.СписокМобильныхУстройств.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		
		ОбновитьРезультатВКолонке(СтрокаТаблицы.ВыгрузкаИконка, СтрокаТаблицы.ВыгрузкаСостояние, 
					Выборка, "Выгрузка", ВсеКоды);
		ОбновитьРезультатВКолонке(СтрокаТаблицы.ЗагрузкаИконка, СтрокаТаблицы.ЗагрузкаСостояние, 
					Выборка, "Загрузка", ВсеКоды);
		
		УстройстваИзЗапроса[Выборка.Устройство] = Истина;
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если УстройстваИзЗапроса[СтрокаТаблицы.Ключ] = Неопределено Тогда
			Форма.СписокМобильныхУстройств.Удалить(СтрокаТаблицы.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ТекстПодробностейСостоянияОбмена(ОписаниеКода, ТекстОшибки)
	
	Результат = СтрШаблон(НСтр("ru='%1
	|
	|%2
	|
	|%3'"), ОписаниеКода.ТекстОписания, ОписаниеКода.ТекстРекомендации, 
		?(ЗначениеЗаполнено(ТекстОшибки), "Текст сообщения: " + ТекстОшибки, ""));
		
	Возврат Результат;
	
КонецФункции

Функция СоответствиеСтрокТаблицы(Форма)
	Результат = Новый Соответствие; 
	Для каждого СтрокаТаблицы Из Форма.СписокМобильныхУстройств Цикл
		Результат.Вставить(СтрокаТаблицы.Устройство, СтрокаТаблицы);
	КонецЦикла;
	Возврат Результат;
КонецФункции 


Процедура ОбновитьРезультатВКолонке(ИконкаРезультата, ТекстРезультата, Выборка, Префикс, ВсеКоды)
	
	ДатаРезультата = Выборка[Префикс + "Дата"];
	КодРезультата  = Выборка[Префикс + "КодРезультата"];
	Действие       = Выборка[Префикс + "Действие"];
	//ТекстОшибки    = Выборка[Префикс + "ТекстОшибки"];

	ДатаРезультатаСтрокой = ?(ЗначениеЗаполнено(ДатаРезультата), 
			Формат(ДатаРезультата, ?(ДатаРезультата > НачалоДня(ТекущаяДата()), "ДФ='ЧЧ:мм:сс'", "ДФ='дд МММ. ""в"" ЧЧ:мм'")), 
			"");
	
	Если КодРезультата = ВсеКоды.Выполнено.Код Тогда
		ИконкаРезультата = БиблиотекаКартинок.ОформлениеФлажок;
		ТекстРезультата = СтрШаблон("%1, %2: ОК", ДатаРезультатаСтрокой, Действие);
		
	ИначеЕсли КодРезультата = ВсеКоды.Неизвестно.Код Тогда
		ИконкаРезультата = БиблиотекаКартинок.Синхронизация16;
		ТекстРезультата = СтрШаблон("%1, %2: не завершено", ДатаРезультатаСтрокой, Действие);
		
	Иначе
	
		ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(КодРезультата);
		Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
			ИконкаРезультата = БиблиотекаКартинок.ОформлениеКрест;
		Иначе
			ИконкаРезультата = БиблиотекаКартинок.ДиалогВосклицание;
		КонецЕсли;
		ТекстРезультата = СтрШаблон("%1, %2: %3", ДатаРезультатаСтрокой, Действие, ОписаниеРезультата.ТекстОписания);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
